# Дан список:
# nums = [10, 20, 30, 40, 50, 60, 70]
# Нужно получить срезами и вывести:
# 1) первые три элемента
# 2) последние три элемента
# 3) элементы с индекса 1 по индекс 4 включительно
# 4) каждый второй элемент списка

nums = [10, 20, 30, 40, 50, 60, 70]

print(nums[0:3])
print(nums[:])
print()